Repository: pcescato/wp-jamstack-sync
Catalog: languages/atomic-jamstack-connector-*.po
Languages: fr_fr

source: Atomic Jamstack Connector requires WordPress %s or higher.
fr_fr: Atomic Jamstack Connector nécessite WordPress %s ou supérieur.

source: Atomic Jamstack Connector requires PHP %s or higher.
fr_fr: Atomic Jamstack Connector nécessite PHP %s ou supérieur.

source: Plugin Activation Failed
fr_fr: Échec de l'activation du plugin

source: Return to Plugins
fr_fr: Retour aux extensions

source: Plugin Activation Error
fr_fr: Erreur d'activation du plugin

source: Jamstack Sync Settings
fr_fr: Paramètres de synchronisation Jamstack

source: Jamstack Sync
fr_fr: Synchronisation Jamstack

source: Testing connection...
fr_fr: Test de la connexion...

source: Connection successful!
fr_fr: Connexion réussie !

source: Connection failed:
fr_fr: Échec de la connexion :

source: Sync Status
fr_fr: État de synchronisation

source: Success
fr_fr: Succès

source: Error
fr_fr: Erreur

source: Processing
fr_fr: En cours

source: Pending
fr_fr: En attente

source: Cancelled
fr_fr: Annulé

source: Deleting
fr_fr: Suppression

source: Deleted
fr_fr: Supprimé

source: Delete Error
fr_fr: Erreur de suppression

source: Unknown
fr_fr: Inconnu

source: Synced
fr_fr: Synchronisé

source: Updated
fr_fr: Mis à jour

source: %s ago
fr_fr: il y a %s

source: GitHub Settings
fr_fr: Paramètres GitHub

source: Personal Access Token
fr_fr: Jeton d'accès personnel

source: Repository (owner/repo)
fr_fr: Dépôt (propriétaire/dépôt)

source: Branch
fr_fr: Branche

source: Test GitHub Connection
fr_fr: Tester la connexion GitHub

source: Content Types
fr_fr: Types de contenu

source: Synchronize Posts
fr_fr: Synchroniser les articles

source: Automatically sync posts to your Hugo repository
fr_fr: Synchroniser automatiquement les articles vers votre dépôt Hugo

source: Synchronize Pages
fr_fr: Synchroniser les pages

source: Automatically sync pages to your Hugo repository
fr_fr: Synchroniser automatiquement les pages vers votre dépôt Hugo

source: GitHub Personal Access Token with repo permissions
fr_fr: Jeton d'accès personnel GitHub avec permissions sur le dépôt

source: Format: username/repository (e.g., johndoe/my-hugo-site)
fr_fr: Format : nom_utilisateur/dépôt (ex : johndoe/mon-site-hugo)

source: Target branch for commits (default: main)
fr_fr: Branche cible pour les commits (par défaut : main)

source: Invalid settings data
fr_fr: Données de configuration invalides

source: Token cannot be empty
fr_fr: Le jeton ne peut pas être vide

source: Repository cannot be empty
fr_fr: Le dépôt ne peut pas être vide

source: Repository must be in format: owner/repo
fr_fr: Le dépôt doit être au format : propriétaire/dépôt

source: Settings saved
fr_fr: Paramètres enregistrés

source: Settings
fr_fr: Paramètres

source: Bulk Operations
fr_fr: Opérations en masse

source: Sync History
fr_fr: Historique de synchronisation

source: Bulk Sync
fr_fr: Synchronisation en masse

source: Synchronize All Posts
fr_fr: Synchroniser tous les articles

source: This will enqueue all published posts and pages for synchronization.
fr_fr: Ceci va mettre en file d'attente tous les articles et pages publiés pour synchronisation.

source: Start Bulk Sync
fr_fr: Démarrer la synchronisation en masse

source: Queue Statistics
fr_fr: Statistiques de la file

source: Pending:
fr_fr: En attente :

source: Processing:
fr_fr: En traitement :

source: Failed:
fr_fr: Échec :

source: Success:
fr_fr: Succès :

source: View the most recent sync operations and their status.
fr_fr: Voir les opérations de synchronisation les plus récentes et leur état.

source: No sync history found. Sync a post to see it appear here.
fr_fr: Aucun historique de synchronisation trouvé. Synchronisez un article pour le voir apparaître ici.

source: Post Title
fr_fr: Titre de l'article

source: Status
fr_fr: État

source: Last Sync
fr_fr: Dernière synchronisation

source: View Commit
fr_fr: Voir le commit

source: Sync Now
fr_fr: Synchroniser maintenant

source: Syncing...
fr_fr: Synchronisation...

source: Synced!
fr_fr: Synchronisé !

source: Insufficient permissions
fr_fr: Permissions insuffisantes

source: %1$d posts enqueued, %2$d skipped
fr_fr: %1$d articles mis en file, %2$d ignorés

source: Invalid post ID
fr_fr: ID d'article invalide

source: Post enqueued for synchronization
fr_fr: Article mis en file pour synchronisation

source: GitHub token is not configured. Please add your token in plugin settings.
fr_fr: Le jeton GitHub n'est pas configuré. Veuillez ajouter votre jeton dans les paramètres du plugin.

source: GitHub repository is not configured. Please add repository in format: owner/repo
fr_fr: Le dépôt GitHub n'est pas configuré. Veuillez ajouter le dépôt au format : propriétaire/dépôt

source: Failed to connect to GitHub: %s
fr_fr: Échec de connexion à GitHub : %s

source: GitHub token does not have push permission to this repository. Please check token permissions.
fr_fr: Le jeton GitHub n'a pas la permission push sur ce dépôt. Veuillez vérifier les permissions du jeton.

source: GitHub token is invalid or expired. Please check your token.
fr_fr: Le jeton GitHub est invalide ou expiré. Veuillez vérifier votre jeton.

source: GitHub API rate limit exceeded. Resets at: %s UTC
fr_fr: Limite de taux de l'API GitHub dépassée. Réinitialisation à : %s UTC

source: Access forbidden: %s
fr_fr: Accès interdit : %s

source: Repository not found: %s. Please check the repository name and your access permissions.
fr_fr: Dépôt introuvable : %s. Veuillez vérifier le nom du dépôt et vos permissions d'accès.

source: GitHub API error (HTTP %1$d): %2$s
fr_fr: Erreur API GitHub (HTTP %1$d) : %2$s

source: GitHub configuration missing
fr_fr: Configuration GitHub manquante

source: Invalid API response
fr_fr: Réponse API invalide

source: Unable to retrieve file SHA for deletion
fr_fr: Impossible de récupérer le SHA du fichier pour suppression

source: GitHub token missing
fr_fr: Jeton GitHub manquant

source: Post not found
fr_fr: Article introuvable

source: Only published posts can be synced
fr_fr: Seuls les articles publiés peuvent être synchronisés

source: Post not found and no cached file path available
fr_fr: Article introuvable et aucun chemin de fichier en cache disponible
